In [4]:
import pandas as pd

grades_dict= {'Wally': [87,96,70], 'Eva' : [87,100,90], 'Sam' : [84,77,90],'Katie': [100,81,82], 'Bob': [83,65,85]}

grades= pd.DataFrame(grades_dict)

grades

   Wally  Eva  Sam  Katie  Bob
0     87   87   84    100   83
1     96  100   77     81   65
2     70   90   90     82   85

In [8]:
grades.index= ['Test 1','Test 2', 'Test 3']

grades['Eva']

grades.Sam

grades.loc['Test 1']

grades.iloc[0]

grades.iloc[1]

grades.iloc[0:2]

grades.loc['Test 1': 'Test 3']

        Wally  Eva  Sam  Katie  Bob
Test 1     87   87   84    100   83
Test 2     96  100   77     81   65
Test 3     70   90   90     82   85

In [9]:
grades.at['Test 2','Eva']

grades.iat[2,0]

70

In [10]:
grades.describe()

pd.set_option

In [11]:
grades

grades.mean

grades.T

grades.T.describe()

          Test 1      Test 2     Test 3
count    5.00000    5.000000   5.000000
mean    88.20000   83.800000  83.400000
std      6.83374   14.307341   8.234076
min     83.00000   65.000000  70.000000
25%     84.00000   77.000000  82.000000
50%     87.00000   81.000000  85.000000
75%     87.00000   96.000000  90.000000
max    100.00000  100.000000  90.000000

In [12]:
grades.sort_index(ascending=False)

grades.sort_index(axis=1)

        Bob  Eva  Katie  Sam  Wally
Test 1   83   87    100   84     87
Test 2   65  100     81   77     96
Test 3   85   90     82   90     70